### Ordinal Number Encoding

In [1]:
import datetime

In [3]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2022, 3, 14, 11, 59, 19, 376848)

In [ ]:
today_day - datetime.timedelta(3)

In [9]:
##list compresheions 

day = [today_date-datetime.timedelta(x) for x in range(0,14)]

In [10]:
import pandas as pd 
data = pd.DataFrame(day)
data.columns=['Day']

In [11]:
data.head()

                         Day
0 2022-03-14 11:59:19.376848
1 2022-03-13 11:59:19.376848
2 2022-03-12 11:59:19.376848
3 2022-03-11 11:59:19.376848
4 2022-03-10 11:59:19.376848

In [16]:
data['day_name']= data['Day'].dt.day_name()

In [17]:
data.head()

                         Day  day_name
0 2022-03-14 11:59:19.376848    Monday
1 2022-03-13 11:59:19.376848    Sunday
2 2022-03-12 11:59:19.376848  Saturday
3 2022-03-11 11:59:19.376848    Friday
4 2022-03-10 11:59:19.376848  Thursday

In [20]:
dictionary = {'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [23]:
data['day_ordinal']=data['day_name'].map(dictionary)

In [24]:
data

                          Day   day_name  day_ordinal
0  2022-03-14 11:59:19.376848     Monday            1
1  2022-03-13 11:59:19.376848     Sunday            7
2  2022-03-12 11:59:19.376848   Saturday            6
3  2022-03-11 11:59:19.376848     Friday            5
4  2022-03-10 11:59:19.376848   Thursday            4
5  2022-03-09 11:59:19.376848  Wednesday            3
6  2022-03-08 11:59:19.376848    Tuesday            2
7  2022-03-07 11:59:19.376848     Monday            1
8  2022-03-06 11:59:19.376848     Sunday            7
9  2022-03-05 11:59:19.376848   Saturday            6
10 2022-03-04 11:59:19.376848     Friday            5
11 2022-03-03 11:59:19.376848   Thursday            4
12 2022-03-02 11:59:19.376848  Wednesday            3
13 2022-03-01 11:59:19.376848    Tuesday            2

###### Count or Frequency Encoding

In [50]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [51]:
cat_fea =[1,3,5,6,7,8,9,13] ##cat feature

In [41]:
cat_fea = df.select_dtypes(include=['object']).columns
cat_fea

Int64Index([1, 3, 5, 6, 7, 8, 9, 13, 14], dtype='int64')

In [52]:
df = df[cat_fea]

In [53]:
df.columns=['Employemnet','Degree','Status','Designation','family_job','Race','Sex','Country']

In [54]:
df.head()

,Employemnet,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [60]:
len(df['Employemnet'].unique())

9

In [57]:
for feature in df.columns[:]:
    print(feature,':',len(df[feature].unique()),'lables')

Employemnet : 9 lables
Degree : 16 lables
Status : 7 lables
Designation : 15 lables
family_job : 6 lables
Race : 5 lables
Sex : 2 lables
Country : 42 lables

In [64]:
country_map = df['Country'].value_counts().to_dict()

In [66]:
df['Country'] = df['Country'].map(country_map)

In [67]:
df.head()

,Employemnet,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

### Advantages
Easy To Use

Not increasing feature space

##### Disadvantages
It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding

Ordering the labels according to the target

Replace the labels by the joint probability of being 1 or 0

In [74]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv",usecols=['Survived','Cabin'])

In [76]:
df

     Survived Cabin
0           0   NaN
1           1   C85
2           1   NaN
3           1  C123
4           0   NaN
..        ...   ...
886         0   NaN
887         1   B42
888         0   NaN
889         1  C148
890         0   NaN

[891 rows x 2 columns]

In [77]:
df.isnull().sum()

Survived      0
Cabin       687
dtype: int64

In [79]:
df['Cabin'].fillna('Missing',inplace=True)

In [81]:
df.head(30)

    Survived        Cabin
0          0      Missing
1          1          C85
2          1      Missing
3          1         C123
4          0      Missing
5          0      Missing
6          0          E46
7          0      Missing
8          1      Missing
9          1      Missing
10         1           G6
11         1         C103
12         0      Missing
13         0      Missing
14         0      Missing
15         1      Missing
16         0      Missing
17         1      Missing
18         0      Missing
19         1      Missing
20         0      Missing
21         1          D56
22         1      Missing
23         1           A6
24         0      Missing
25         1      Missing
26         0      Missing
27         0  C23 C25 C27
28         1      Missing
29         0      Missing

In [83]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [84]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [85]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [87]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [89]:
ordinal_lables = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [91]:
enumerate(ordinal_lables,0)

In [90]:
ordinal_lables

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [97]:
ordinal_lables2 = {k:i for i,k in enumerate(ordinal_lables,0)}

In [98]:
ordinal_lables2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [99]:
df['Cabinal_ordinal_lables']=df['Cabin'].map(ordinal_lables2)

In [100]:
df.head()

   Survived Cabin  Cabinal_ordinal_lables
0         0     M                       1
1         1     C                       4
2         1     M                       1
3         1     C                       4
4         0     M                       1

### Mean Encoding

In [103]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [104]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)

In [105]:
df

     Survived Cabin  Cabinal_ordinal_lables  mean_ordinal_encode
0           0     M                       1             0.299854
1           1     C                       4             0.593220
2           1     M                       1             0.299854
3           1     C                       4             0.593220
4           0     M                       1             0.299854
..        ...   ...                     ...                  ...
886         0     M                       1             0.299854
887         1     B                       6             0.744681
888         0     M                       1             0.299854
889         1     C                       4             0.593220
890         0     M                       1             0.299854

[891 rows x 4 columns]